In [73]:
import pandas as pd

In [74]:
def get_one_year_dataframe(year):
    dataframe = pd.read_csv(f'names/yob{year}.txt', names=['Name', 'Gender', 'Count'])
    dataframe['Year'] = year
    return dataframe

In [75]:
def get_many_years_dataframe(years):
    dataframe = pd.DataFrame()
    for year in years:
        dataframe = pd.concat([dataframe, get_one_year_dataframe(year)])
    return dataframe

In [76]:
def count_top3(years, top=3):
    dataframe = get_many_years_dataframe(years)
    top_name = dataframe[['Name', 'Count']] \
        .groupby(['Name']) \
        .sum() \
        .sort_values(by='Count', ascending=False) \
        .head(top)
    return top_name

In [77]:
count_top3([1880])

         Count
Name
John      9701
William   9562
Mary      7092

In [78]:
count_top3([1900, 1950, 2000])

         Count
Name
James   111789
John    109601
Robert  101368

In [79]:
def count_dynamics(years):
    dataframe = get_many_years_dataframe(years)
    dynamics_names = dataframe[['Year', 'Gender', 'Count']] \
        .groupby(['Year', 'Gender']) \
        .sum() \
        .unstack('Gender')
    return dynamics_names

In [80]:
count_dynamics([1900, 1950, 2000])

          Count
Gender        F        M
Year
1900     299798   150480
1950    1713065  1790437
2000    1815295  1963202